<a href="https://colab.research.google.com/github/Daivar/PANDAS-PP3/blob/main/%E2%80%9ESection_8_Creating_Series_and_DataFrames_ipynb%E2%80%9C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Section 8: Creating Series and DataFrames
### Step 1. Import the necessary libraries

In [14]:
import pandas as pd
import numpy as np

### Step 2. Create a data dictionary that looks like the DataFrame below

In [19]:
dicdata_df = [
        {'evolution':['Ivysaur','Charmeleon','Wartortle','Metapod']},
        {'hp':['45','39','44','45']},
        {'name':['Bulbasaur','Charmander','Squirtle','Caterpie']},
        {'pokedex':['yes','no','yes','no']},
        {'type':['grass','fire','water','bug']}
]
dicdata_df

[{'evolution': ['Ivysaur', 'Charmeleon', 'Wartortle', 'Metapod']},
 {'hp': ['45', '39', '44', '45']},
 {'name': ['Bulbasaur', 'Charmander', 'Squirtle', 'Caterpie']},
 {'pokedex': ['yes', 'no', 'yes', 'no']},
 {'type': ['grass', 'fire', 'water', 'bug']}]

### Step 3. Assign it to a variable called pokemon

In [25]:
called_pokemon = pd.DataFrame(dicdata)
called_pokemon

    evolution  hp        name pokedex   type
0     Ivysaur  45   Bulbasaur     yes  grass
1  Charmeleon  39  Charmander      no   fire
2   Wartortle  44    Squirtle     yes  water
3     Metapod  45    Caterpie      no    bug

### Step 4. Ops...it seems the DataFrame columns are in alphabetical order. Place the order of the columns as name, type, hp, evolution, pokedex

In [28]:
called_pokemon = pd.DataFrame(dicdata, columns=['name', 'type', 'hp', 'evolution', 'pokedex'])
called_pokemon

         name   type  hp   evolution pokedex
0   Bulbasaur  grass  45     Ivysaur     yes
1  Charmander   fire  39  Charmeleon      no
2    Squirtle  water  44   Wartortle     yes
3    Caterpie    bug  45     Metapod      no

### Step 5. Add another column called place, and insert what you have in mind.

In [32]:
place = ['Vilnius', 'Kaunas', 'Klaipėda', 'Šiauliai']
called_pokemon['Address'] = place
called_pokemon

         name   type  hp   evolution pokedex   Address
0   Bulbasaur  grass  45     Ivysaur     yes   Vilnius
1  Charmander   fire  39  Charmeleon      no    Kaunas
2    Squirtle  water  44   Wartortle     yes  Klaipėda
3    Caterpie    bug  45     Metapod      no  Šiauliai

### Step 6. Present the type of each column

In [34]:
called_pokemon.dtypes

name         object
type         object
hp            int64
evolution    object
pokedex      object
Address      object
dtype: object

### BONUS: Create your own question and answer it - describe column name

In [36]:
called_pokemon['name'].describe(include= 'all')

count             4
unique            4
top       Bulbasaur
freq              1
Name: name, dtype: object

In [37]:
called_pokemon['name'].unique()

array(['Bulbasaur', 'Charmander', 'Squirtle', 'Caterpie'], dtype=object)